# Taps
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-eid"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "buo/cask-upgrade"
tap "getantibody/tap"
tap "rhyeal/aws-rotate-iam-keys", "https://github.com/rhyeal/aws-rotate-iam-keys"
tap "fabianishere/personal/pam_reattach"

# Java dependency
cask "java"                                   # for working with internet banking and installing some dependencies

# Install Binaries
brew "antibody"                                   # ZSH plugin manager
brew "awscli"                                     # AWS cli
brew "aws-elasticbeanstalk"                       # AWS ElasticBeanstalk cli
brew "aws-rotate-iam-keys", restart_service: true # script to automatically rotate IAM access keys
# brew "docker"                                     # virtualization containers management
brew "dnscrypt-proxy", restart_service: true      # allows using DNS via HTTPS
brew "git"                                        # version controll system
brew "go"                                         # programming language
brew "mackup"                                     # macOS config synchronization tool
# brew "mongodb"                                    # noSQL database
brew "mas"                                        # allows to install apps from Apple AppStore
# brew "node"                                       # node.js engine
brew "packer"                                     # create AWS AMI images
brew "pam_reattach"                               # ability to use touch ID instead of password for sudo
brew "peco"                                       # powerful alternative to grep
brew "redis"                                      # in memory key value database
brew "terraform"                                  # framework for cloud blueprints
brew "terminal-notifier"                          # required by marzocchi/zsh-notify plugin
brew "trash"                                      # allow to "Send to trash" from commands line
brew "tree"                                       # show file tree
brew "watchman"                                   # needed for watch operations in node projects
brew "wget"                                       # download client
# brew "zsh"                                        # shell alternative to bash

# Apps
cask "1password-cli"                          # 1password CLI tool
cask "abstract"                               # Sketch VCS tool
cask "aerial"                                 # Apple TV Aerial screen saver
cask "alfred"                                 # Alfred (great clipboard history)
cask "appcleaner"                             # App for deleting apps
cask "aware"                                  # menu bar app to tell how long you've been using the mac
cask "bitbar"                                 # toolbar apps
cask "brainfm"                                # generate music to help focus
cask "brave-browser"                          # Chromium based browser
cask "calibre"                                # ebooks app
cask "dash"                                   # Many developer documentations in one app with offline usage possible
# cask "docker"                                 # UI for virtualization containers management
# cask "google-chrome"                          # browser
# cask "go2shell"                               # open shell from Finder
cask "goofy"                                  # facebook messenger
cask "gfxcardstatus"                          # what graphic card is being used atm
cask "gpg-suite"                              # GPG encryption tools
cask "grammarly"                              # spell checking
cask "haptic-touch-bar"                       # haptic feedback for Macbook Pro Touch Bar
# cask "insomnia"                               # http client
cask "iterm2"                                 # terminal app
cask "keybase"                                  # app for PGP encryption of data
# cask "kindle"                                 # Kindle books client
# cask "mongodb"                                # noSQL database UI
# cask "muzzle"                                 # turn off notifications during screen sharing
# cask "phantomjs"                              # headless browser
# cask "plex-media-player"                      # client for Plex media server
cask "postman"                                # http client
cask "protonvpn"                              # VPN service
# cask "raindropio"                             # bookmarks
cask "rescuetime"                             # time tracking app
# cask "robo-3t"                                # mongodb client
cask "session-manager-plugin"                 # AWS SSM SessionManager plugin
# cask "sip"                                    # color picking tool
# cask "sip2sip"                                # SIP voice calling
# cask "sizeup"                                 # arrang windows
cask "skype"                                  # VoIP
cask "slack"                                  # team communication tool
cask "sourcetree"                             # git client
cask "subler"                                 # edit video files
cask "teamviewer"                             # remote control
# cask "torbrowser"                             # browser to use tor network
# cask "transmission"                           # torrent client
cask "tunnelblick"                            # OpenVPN client
cask "viber"                                  # messenger
cask "visual-studio-code"                     # ide
cask "vlc"                                    # video player
cask "waltr"                                  # transfer videos to iPhone
cask "webex-meetings"                         # Cisco Webex Metting client
cask "zoomus"                                 # VoIP

# Paid apps
cask "backblaze"                              # backup system
cask "bartender"                              # hide icons in macOS menu bar
# cask "beamer"                                 # stream videos to Apple TV
cask "daisydisk"                              # analyze disk usage in a visual way
cask "eaglefiler"                             # documents management application
cask "expressvpn"                             # VPN client
cask "microsoft-office"                       # Microsoft Word, Excel etc.
cask "parallels"                              # virtualization engine
cask "setapp"                                 # collection of apps with subscription
cask "sketch"                                 # vector graphics editor
# cask "transmit"                               # ftp client

# Quicklook
# cask "qlcolorcode"                            # impossible to install...
cask "qlmarkdown"                             # renders markdown
cask "qlstephen"                              # renders files without extensions (e.g. README)
cask "quicklook-json"                         # renders json
cask "quicklook-csv"                          # renders csv
cask "qlmobi"                                 # renders various ebook formats used on kindle readers

# Fonts
# cask "font-droid-sans-mono-for-powerline"     # font for iTerm with extra icons
# cask "font-fira-code"                         # font for vs studio code with lingering support
# cask "font-source-code-pro-for-powerline"
# cask "font-source-code-pro"
# cask "font-source-sans-pro"
# cask "font-source-serif-pro"
# cask "font-droidsansmono-nerd-font"
# cask "font-droidsansmono-nerd-font-mono"
cask "font-firacode-nerd-font"
# cask "font-firacode-nerd-font-mono"

# Install Mac App Store apps
mas "1Password 7", id: 1333542190             # password manager
# mas "Agenda", id: 1287445660                  # work related markdown editor
mas "Amphetamine", id: 937984704              # prevent laptop from sleeping
mas "Day One", id: 1055511498                 # markdown based journalig app
mas "DuckDuckGo", id: 1482920575              # plugin for Safari
mas "Friendly Streaming", id: 553245401       # client for Netflix etc.
mas "Gestimer", id: 990588172                 # timer
mas "Grammarly for Safari", id: 1462114288    # spellcheck Safari plugin
mas "Keynote", id: 409183694                  # Apple keynotes editor
# mas "Mediunic", id: 1088945121                # medium client
mas "Numbers", id: 409203825                  # Apple spreadsheets editor
mas "Pages", id: 409201541                    # Apple rich text editor
# mas "Spark", id: 1176895641                   # email client
mas "The Unarchiver", id: 425424353           # archiving tool
mas "Telegram", id: 747648890                 # chat
mas "Trello", id: 1278508951                  # productivity tool
mas "UlyssesMac", id: 1225570693              # markdown editor
mas "UPRIGHT GO Desktop", id: 1404231964      # remined to sit straight
# mas "Xcode", id: 497799835                    # Apple IDE

# Paid Mac App Store apps
mas "1Blocker", id: 1107421413                # ads blocker for safari
# mas "Deliveries", id: 924726344               # parcel delivery notifcations
mas "Disconnect Premium", id: 1333277187      # AD blocker
# mas "EyeFitness", id: 1114775590              # eye training app
mas "Gestimer", id: 990588172                 # drag to add remined
# mas "IP Man", id: 1368026859                  # get info about public ip address
mas "Just Press Record", id: 979561272        # dictaphone app
mas "Medis", id: 1063631769                   # redis client
# mas "Monit", id: 1014850245                   # sidebar CPU/memory/... widget
# mas "Paste", id: 967805235                    # clipboard history
mas "PDF Expert", id: 1055273043              # powerful PDF reader
mas "Pixelmator Pro", id: 1289583905          # image editor
mas "PopClip", id: 445189367                  # iOS style copy/paste menu
# mas "Reeder", id: 880001334                   # news reader
mas "Things", id: 904280696                   # task manager
mas "WaterMinder", id: 1415257369             # reminder to drink water
